#!/bin/bash

speed=0.1
p1="   ╔═╗╦ ╦   ╔╗ ╦ ╦╔╗╔╦╔═╔═╗╦═╗\n   ║  ╚╦╝───╠╩╗║ ║║║║╠╩╗║╣ ╠╦╝\n   ╚═╝ ╩    ╚═╝╚═╝╝╚╝╩ ╩╚═╝╩╚═\n\n\n\n┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n"
p2="┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛"

for i in {1..2}; do
    
printf "$p1" 
echo ┃⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜┃
printf "$p2" 
sleep $speed
clear
##
printf "$p1" 
echo ┃⬛⬛⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜┃
printf "$p2" 
sleep $speed
clear
##
printf "$p1" 
echo ┃⬛⬛⬛⬛⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜┃
printf "$p2" 
sleep $speed
clear
##
printf "$p1" 
echo ┃⬜⬜⬛⬛⬛⬛⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜┃
printf "$p2" 
sleep $speed
clear
##
printf "$p1" 
echo ┃⬜⬜⬜⬜⬛⬛⬛⬛⬜⬜⬜⬜⬜⬜⬜⬜┃
printf "$p2" 
sleep $speed
clear
##
printf "$p1" 
echo ┃⬜⬜⬜⬜⬜⬜⬛⬛⬛⬛⬜⬜⬜⬜⬜⬜┃
printf "$p2" 
sleep $speed
clear
##
printf "$p1" 
echo ┃⬜⬜⬜⬜⬜⬜⬜⬜⬛⬛⬛⬛⬜⬜⬜⬜┃
printf "$p2" 
sleep $speed
clear
##
printf "$p1" 
echo ┃⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬛⬛⬛⬛⬜⬜┃
printf "$p2" 
sleep $speed
clear
##
printf "$p1" 
echo ┃⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬛⬛⬛⬛┃
printf "$p2" 
sleep $speed
clear
##
printf "$p1" 
echo ┃⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬜⬛⬛┃
printf "$p2" 
sleep $speed
clear
##
done
printf "$p1" 
echo ┃🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩┃
printf "$p2" 
sleep $speed
clear
##

