#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <ncurses.h>




void user(){
  printf("╔═════════════════════════════════════════════════════════╗\n"); 
  printf("║   Пользовательский файл            21 января 1949 г.    ║\n"); 
  printf("╟─────────────────────────────────────────────────────────╢\n"); 
  printf("║         OFFICER                         ACCESS          ║\n"); 
  printf("║         K-12345                         ******          ║\n"); 
  printf("╠════════════════════════════════╦════════════════════════╣\n");
  printf("║                                ║                        ║\n"); 
  printf("║                                ║                        ║\n"); 
  printf("║                                ║                        ║\n"); 
  printf("║                                ║                        ║\n"); 
  printf("║                                ║                        ║\n"); 
  printf("║                                ║                        ║\n"); 
  printf("║                                ║                        ║\n"); 
  printf("║                                ║                        ║\n"); 
  printf("║                                ║                        ║\n"); 
  printf("║                                ║                        ║\n"); 
  printf("╠════════════════════════════════╩════════════════════════╣\n");
  printf("║     авторизация предоставлено вышеперечисленным для     ║\n"); 
  printf("║      задержания,идентификации и/или изъятия любого      ║\n"); 
  printf("║    физического или юридического лица, подозреваемого    ║\n"); 
  printf("║ в предшествующем нарушении закона о запрете репликантов ║\n"); 
  printf("║          1949 года или ином нарушении разрешенных       ║\n"); 
  printf("║               эксплуатационных параметров.              ║\n"); 
  printf("╠═════════════════════════════════════════════════════════╣\n");
  printf("║                  собственность россии                   ║\n"); 
  printf("║    𒋲                                              𒋲     ║\n"); 
  printf("║             полиция/отделение обнаружения               ║\n"); 
  printf("╚═════════════════════════════════════════════════════════╝\n"); 



}


int main(){

  user();
  printf("\n");

}
